export default {
  notEmpty:(rule,value,callback)=>{
    if(value==''||value=='undefind')
      callback(new Error(rule.message?rule.message:'该字段不能为空'))
    else callback();
  },
  cellphone:(rule,value,callback)=>{
    if(!/^1(3|4|5|6|7|8|9)\d{9}$/.test(value))
      callback(new Error('请输入正确格式的手机号'))
    else callback();
  },
  integer:(rule,value,callback)=>{
    if(!/^(0|[1-9][0-9]*|-[1-9][0-9]*)$/.test(value))
      callback(new Error('请输入正确格式的手机号'))
    else callback();
  },
  email:(rule,value,callback)=>{
    if(!/^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/.test(value))
      callback(new Error('请输入正确格式的手机号'))
    else callback();
  },
  password:(rule,value,callback)=>{
    if(!/^([A-Za-z\d_]{6,9})+$/.test(value))
      callback(new Error(rule.message?rule.message:'密码只允许数字、字母、下划线，且限制在6到8位'))
    else callback();
  }
}
/*
1 不能包括中英文逗号及竖线
/^((?!,|，|\|).)*$/ 

2 整数
/^(0|[1-9][0-9]*|-[1-9][0-9]*)$/

3 1-999整数
/^[1-9]\d{0,2}$/

4 大于0数字，保留2位小数
/^0\.([1-9]|\d[1-9])$|^[1-9]\d*(\.([0-9]|\d[0-9]))?$/

5 邮箱校验
/^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/

6 手机 数字和符号“-”、“_”
/^([\d_\-\+]+)+$/

/^([\w\u4E00-\u9FA5_\-\(\)\（\）\s.&,]+)+$/,//中英文、数字、空格和符号“-”,“_”,","(",")","（","）","&",","
/^([\w\u4E00-\u9FA5_\-\(\)\（\）\s.,]+)+$/,//中英文、数字、空格和符号“-”,“_”,","(",")","（","）",","
/^[0-9]+(.[0-9]{1,2})?$/, //只能输入最多2位的小数
/^[0-9]+(.[0-9]{1,4})?$/, //只能输入最多4位的小数
"/^[0-9]*[1-9][0-9]*$/, //正整数
/^([\w]+)+$/, //英文和数字
/^([\w\u4E00-\u9FA5_\-.]+)+$/,//中英文、数字和符号“-”、“_”,"."
/^([\w\u4E00-\u9FA5_\-\,\s.]+)+$/,//中英文、数字和符号“-”、“_”,".",空格，','
"/^([\w\u4E00-\u9FA5_\-\(\)\（\）\s]+)+$/,//中英文、数字和符号“-”,“_”,"()（）"空格
" /^([\w_\-\(\)\（\）\s]+)+$/,    //英文、数字和符号“-”、“_”,"()","（）"空格
 /^([\u4E00-\u9FA5_\-\(\)\（\）\d]+)+$/,    //中文、数字和符号“-”、“_”,"()","（）"
 /^([\w\u4E00-\u9FA5_\-]+)+$/,    //中英文、数字和符号“-”、“_”

/^([\w_\-]+)+$/,    //大小写英文、数字和符号“-”、“_”
/^([A-Za-z\d\-\&\.\,\(\)\s]+)+$/,    //大小写英文、数字和符号&、.、,、-、(、)
/^([\w_\-\s]+)+$/,    //大小写英文、数字和符号“-”、“_”、空格
*/
